Repository: KiYouJyo/UrbanPlanToolbox
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Settings_ApplicationSettingsTitle
source: App settings
zh_cn: 应用设置

# Settings_ApplicationSettingsDescription
source: Manage app-wide preferences without affecting projects or tool data.
zh_cn: 管理应用级偏好，不影响项目和工具数据。

# Settings_RestoreDefaultsScopeDescription
source: Restore the default theme, language, and other saved preferences without deleting projects, archives, tool data, or attachments.
zh_cn: 恢复主题、语言及其他已保存偏好的默认选择，不会删除项目、归档、工具数据或附件。

# About_ProductName.Text
source: Planning Toolbox
zh_cn: 规划工具箱

# About_Tagline.Text
source: A Windows toolbox for architecture, urban planning, design, and research.
zh_cn: 面向建筑、城乡规划、设计与科研人员的 Windows 工具箱。

# About_AppInformation.Text
source: Application information
zh_cn: 应用信息

# About_DisplayVersionLabel.Text
source: Display version
zh_cn: 显示版本

# About_PackageVersionLabel.Text
source: Package version
zh_cn: 包版本

# About_ArchitectureLabel.Text
source: Architecture
zh_cn: 当前架构

# About_ChannelLabel.Text
source: Distribution channel
zh_cn: 发行渠道

# About_PublisherLabel.Text
source: Publisher
zh_cn: 发布者

# About_TechnologyLabel.Text
source: Technology
zh_cn: 技术栈

# About_CopyrightLabel.Text
source: Copyright
zh_cn: 版权

# About_PrivacyTitle.Text
source: Privacy and data
zh_cn: 隐私与数据

# About_PrivacySummary.Text
source: No account is required. Projects, settings, favorites, and other app data stay on this device by default. Chosen work folders retain only necessary references or access permissions. Exports do not include logs, caches, certificates, or keys. Network access occurs only when you request an update check, open a project link, or use a clearly marked online feature.
zh_cn: 应用不要求注册账户。项目、设置、收藏和其他应用数据默认保存在本机。用户选择的工作文件夹仅保存必要的引用或系统访问权限信息。导出数据不包含日志、缓存、证书或密钥。网络访问仅发生在你主动检查更新、打开项目链接或使用明确标注的联网功能时。

# About_OpenSourceTitle.Text
source: Open source and project links
zh_cn: 开源与项目链接

# About_OpenSourceSummary.Text
source: UrbanPlanToolbox is open source under the MIT License. Source code is hosted on GitHub. Issues, suggestions, defect reports, and pull requests are welcome.
zh_cn: UrbanPlanToolbox 采用 MIT License 开源，源代码托管于 GitHub。欢迎通过 Issue 提交问题、建议和缺陷报告，也欢迎提交 Pull Request。

# About_UpdateTitle.Text
source: Update management
zh_cn: 更新管理

# About_CurrentVersionLabel.Text
source: Current version
zh_cn: 当前版本

# About_UpdateSourceLabel.Text
source: Update source
zh_cn: 更新来源

# About_UpdateStatusLabel.Text
source: Status
zh_cn: 状态

# About_Unavailable
source: Unavailable
zh_cn: 不可用

# About_ChannelGitHub
source: GitHub sideload
zh_cn: GitHub 侧载

# Action_GitHubRepository
source: GitHub repository
zh_cn: GitHub 仓库

# Action_SubmitIssue
source: Submit issue
zh_cn: 提交 Issue

# Action_ViewMitLicense
source: View MIT License
zh_cn: 查看 MIT License

# Action_DownloadAndInstall
source: Download and install
zh_cn: 下载并安装

# Action_OpenReleases
source: Open GitHub Releases
zh_cn: 打开 GitHub Releases

# Update_State_NotChecked
source: Updates have not been checked.
zh_cn: 尚未检查更新

# Update_State_Checking
source: Checking for updates…
zh_cn: 正在检查更新……

# Update_State_UpToDate
source: This is the latest version.
zh_cn: 当前已是最新版本

# Update_State_UpdateAvailable
source: An update is available and ready to download.
zh_cn: 发现新版本，可用更新已准备下载

# Update_State_Downloading
source: Downloading update…
zh_cn: 正在下载更新……

# Update_State_Installing
source: Installing update…
zh_cn: 正在安装更新……

# Update_State_Completed
source: Update completed.
zh_cn: 更新完成

# Update_State_UnsupportedChannel
source: This installation does not support Microsoft Store in-app updates.
zh_cn: 当前安装版本不支持 Microsoft Store 应用内更新。

# Update_State_Cancelled
source: Update was cancelled.
zh_cn: 更新已取消

# Update_State_Failed
source: Update failed. Please try again.
zh_cn: 更新失败，请重试。

# Update_ErrorNetwork
source: Network connection failed.
zh_cn: 网络连接失败。

# Update_ErrorStoreUnavailable
source: Microsoft Store service is unavailable.
zh_cn: Microsoft Store 服务不可用。

# Update_ErrorDownload
source: Update download failed.
zh_cn: 更新下载失败。

# Update_ErrorInstall
source: Update installation failed.
zh_cn: 更新安装失败。

# Update_ErrorNoPending
source: No pending update is available.
zh_cn: 没有可安装的待处理更新。

# Update_ErrorWindowUnavailable
source: The application window is not ready for Store update UI.
zh_cn: 应用窗口尚未准备好显示 Store 更新界面。

# Update_ErrorStoreCode
source: Microsoft Store returned an error.
zh_cn: Microsoft Store 返回错误。

# Update_ErrorGeneric
source: Unable to complete the update.
zh_cn: 无法完成更新。

# Error_OpenExternalLinkFailed
source: Could not open the external link.
zh_cn: 无法打开外部链接。

# Settings_LanguageDescription_Runtime
source: Choose the display language. Changes apply immediately without restarting the app.
zh_cn: 选择界面语言。更改会立即生效，无需重启应用。

# Setting_Language_SwitchFailed
source: The language could not be changed. Your previous language remains active.
zh_cn: 语言切换失败，已继续使用原语言。

# Settings_MilestoneNotificationsTitle
source: Project milestone reminders
zh_cn: 项目时间节点提醒

# Settings_MilestoneNotificationsDescription
source: When enabled, the app sends local notifications for project milestones. Milestones without a specific time are scheduled for 9:00 AM on their date. Turning this off cancels project milestone reminders without deleting milestone data.
zh_cn: 启用后，应用将根据项目中的时间节点发送本机通知。未指定具体时间的时间节点将在当天 09:00 提醒。选择重复间隔后，首次提醒后最多再提醒 3 次。关闭后将停止项目时间节点提醒，但不会删除时间节点数据。

# Settings_MilestoneNotificationsLabel
source: Enable project milestone reminders
zh_cn: 启用项目时间节点提醒

# Settings_MilestoneNotificationsOn
source: On
zh_cn: 开启

# Settings_MilestoneNotificationsOff
source: Off
zh_cn: 关闭

# Action_Later
source: Later
ja_jp: 後で
